app/Controllers/Tasks.php

	public function create()
	{
        $task = new Task($this->request->getPost());

		$task->user_id = $this->current_user->id;

		if ($this->model->insert($task)) {
---
INSERT INTO `task` (`description`, `user_id`, `created_at`, `updated_at`) VALUES ('fasdfasdf', '41', '2025-10-18 00:10:34', '2025-10-18 00:10:34')