app/Models/TaskModel.php

SELECT *
FROM `task`
WHERE `user_id` = '41'
ORDER BY `created_at`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `task`
WHERE `user_id` = '41'
---
    public function paginateTasksByUserId($id)
    {
        return $this->where('user_id', $id)
                    ->orderBy('created_at')
                    ->paginate(5);

SELECT *
FROM `task`
WHERE `id` = '51'
AND `user_id` = '41'
 LIMIT 1
---
    public function getTaskByUserId($id, $user_id)
    {
        return $this->where('id', $id)
                    ->where('user_id', $user_id)
                    ->first();

SELECT `id`, `description`
FROM `task`
WHERE `user_id` = '41'
AND  `description` LIKE '%tarea%' ESCAPE '!'
---
     public function search($term, $user_id)
    {
        if ($term === null) {

            return [];
        }

        return $this->select('id, description')
                    ->where('user_id', $user_id)
                    ->like('description', $term)
                    ->get()
                    ->getResultArray();