app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `email` = 'david@gmail.com'
 LIMIT 1
---
    public function findByEmail(string $email)
    {
        return $this->where('email', $email)->first();